# ReverseOrientation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
NurbsSurfaceData..::..ReverseOrientation Property
NurbsSurfaceData Class See Also
---
If true, the surface's orientation is opposite to the canonical parametric orientation, otherwise it is the same. The canonical parametric orientation is a counter-clockwise sense of rotation in the uv-parameter plane. Extrinsically, the oriented normal vector for the canonical parametric orientation points in the direction of the cross product dS/du x dS/dv, which S(u, v) is the parameterized surface.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool ReverseOrientation { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ReverseOrientation As Boolean
	Get
```

Visual C++
---
```text
public:
property bool ReverseOrientation {
	bool get ();
}
```

# See Also
NurbsSurfaceData Class
Autodesk.Revit.DB Namespace